saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/ARM.Musca_A1_BSP.2.0.0.pdsc
                // Write Secure Debug Authentication Clear Register
                Write32(0x50021008, SECDBGCLR_Val);
              </block>
            </control>
            <control if="SecureDebugEna == 0">
              <control if="DAuthVal &amp; 0x4">
                <block>
                  Query(0, "Cannot configure Debug Authentication, secure debug disabled! Please reboot Board!", 1);
                </block>
              </control>
            </control>

          </control>
        </sequence>
      </sequences>

      <device Dname="Musca">
      <processor Pname="Cortex-M33-0" Dcore="Cortex-M33" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="MPU" Ddsp="NO_DSP" Dtz="TZ" Dendian="Configurable" Dclock="50000000" />
      <processor Pname="Cortex-M33-1" Dcore="Cortex-M33" DcoreVersion="r0p0" Dfpu="FPU" Dmpu="MPU" Ddsp="DSP" Dtz="TZ" Dendian="Configurable" Dclock="50000000" />
        <debug Pname="Cortex-M33-0" svd="SVD/Musca.svd" __dp="0" __ap="1" address="0xE000E000"/>
        <debug Pname="Cortex-M33-1" svd="SVD/Musca.svd" __dp="0" __ap="2" address="0xE000E000"/>
        <algorithm name="Flash/MT25QL512_DC.FLM" start="0x00200000" size="0x10040000" RAMstart="0x20000000" RAMsize="0x00020000" default="1" style="Keil"/>
        <compile header="Device/Include/system_cmsdk_musca.h" />
        <feature type="IOs"           n="16"/>
      </device>
    </family>
  </devices>

  <!-- conditions are dependecy rules that can apply to a component or an individual file -->
  <conditions>
    <condition id="ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Musca CMSIS">
      <description>ARM Musca SoC Device and CMSIS Core</description>
      <accept Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.2:5.0.2"/>
      <accept Cclass="TFM" Cgroup="Core"/>
    </condition>
    <condition id="Musca Device">
      <description>ARM Musca SoC Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="Musca"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Musca SoC Device">
      <description>ARM Musca SoC Device and CMSIS Core</description>
      <require condition="Musca Device"/>
      <require condition="Musca CMSIS"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="Secure Musca SoC Device">
      <description>ARM Musca SoC Device and CMSIS Core</description>
      <require condition="Musca SoC Device"/>
      <require Dsecure="Secure"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="Memory map"/>
      <require Cclass="TFM" Cgroup="Core"/>
    </condition>
    <condition id="Non-Secure Musca SoC Device">
      <description>ARM Musca SoC Device and CMSIS Core</description>
      <require condition="Musca SoC Device"/>
      <require Dsecure="Non-secure"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="Memory map"/>
      <require Cclass="TFM" Cgroup="API"/>
    </condition>
    <condition id="Musca CMSIS MPC Device">
      <description>Musca CMSIS MPC Device</description>
      <require condition="Musca SoC Device"/>
      <require Cclass="Native Driver" Cgroup="Native MPC"/>
    </condition>
    <condition id="Musca CMSIS PPC Device">
      <description>Musca CMSIS PPC Device</description>
      <require condition="Musca SoC Device"/>
      <require Cclass="Native Driver" Cgroup="Native PPC"/>
    </condition>
    <condition id="Musca CMSIS USART Device">
      <description>Musca CMSIS USART Device</description>
      <require condition="Musca SoC Device"/>
      <require Cclass="Native Driver" Cgroup="Native UART"/>
      <require Cclass="Native Driver" Cgroup="Native SCC"/>
    </condition>
    <condition id="Musca CMSIS Flash Device">
      <description>Musca CMSIS USART Device</description>
      <require condition="Musca SoC Device"/>
    </condition>
    <condition id="Musca SCC Driver">
      <description>Musca SCC Driver</description>
      <require condition="Musca SoC Device"/>
      <require Cclass="Native Driver" Cgroup="Native SCC"/>
    </condition>
    <condition id="Musca QSPI Device">
      <description>Musca QSPI Device</description>
      <require condition="Musca SoC Device"/>
      <require Cclass="Native Driver" Cgroup="Native QSPI"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="Memory map" Cversion="1.0.0" condition="Musca Device">
      <description>Musca Memory map</description>
      <files>
        <file category="header" name="Device/Include/partition/flash_layout.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/partition/region_defs.h" version="1.0.0" attr="config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="Secure" Cversion="2.0.0" condition="Secure Musca SoC Device">
      <description>Secure System and Startup for Musca SoC device</description>
      <files>
        <!-- device include path -->
        <file category="include" name="Device/Include/"/>
        <file category="include" name="Native_Driver/"/>
        <file category="include" name="CMSIS_Driver/Include/"/>
        <file category="include" name="Libraries/Include/"/>
        <!-- startup / system file -->
        <file category="linkerScript" name="Device/Source/armclang/musca_s.sct " attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source" name="Device/Source/armclang/startup_cmsdk_musca_s.s" attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source" name="Device/Source/system_cmsdk_musca.c" attr="config" version="1.0.0"/>
        <!-- Retarget files -->
        <file category="source" name="Device/Source/platform_retarget_dev.c" attr="config" version="1.0.0"/>
        <!-- device configuration -->
        <file category="header" name="CMSIS_Driver/Config/RTE_Device.h" attr="config" version="1.0.0"/>
        <file category="header" name="Device/Include/cmsis.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/platform_retarget_pins.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Config/device_cfg.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/cmsis_cpu.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/platform_retarget_dev.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/system_cmsdk_musca.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/target_cfg.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/tfm_peripherals_def.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/mpu_armv8m_drv.h" version="1.0.0" attr="config"/>
        <!-- TFM specific files -->
        <file category="source" name="Device/Source/TFM/dummy_crypto_keys.c" attr="config" version="1.0.0"/>
        <file category="source" name="Device/Source/TFM/target_cfg.c" attr="config" version="1.0.0"/>
        <file category="source" name="Device/Source/TFM/spm_hal.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="Non-Secure" Cversion="2.0.0" condition="Non-Secure Musca SoC Device">
      <description>Non-Secure System and Startup for Musca SoC device</description>
      <files>
        <!-- device include path -->
        <file category="include" name="Device/Include/"/>
        <file category="include" name="Native_Driver/"/>
        <file category="include" name="CMSIS_Driver/Include/"/>
        <file category="include" name="Libraries/Include/"/>
        <!-- startup / system file -->
        <file category="linkerScript" name="Device/Source/armclang/musca_ns.sct " attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source" name="Device/Source/armclang/startup_cmsdk_musca_ns.s" attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source" name="Device/Source/system_cmsdk_musca.c" attr="config" version="1.0.0"/>
        <!-- Retarget files -->
        <file category="source" name="Device/Source/platform_retarget_dev.c" attr="config" version="1.0.0"/>
        <!-- device configuration -->
        <file category="header" condition="Musca SoC Device" name="CMSIS_Driver/Config/RTE_Device.h" attr="config" version="1.0.0"/>
        <file category="header" name="Device/Include/cmsis.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/platform_retarget_pins.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Config/device_cfg.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/cmsis_cpu.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/platform_retarget_dev.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/system_cmsdk_musca.h" version="1.0.0" attr="config"/>
        <file category="header" name="Device/Include/target_cfg.h" version="1.0.0" attr="config"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MPC" Cversion="1.0.0" condition="Musca CMSIS MPC Device">
      <description>MPC (Memory Protection Controller) driver for Musca</description>
      <files>
        <file category="source" name="CMSIS_Driver/Driver_MPC.c"/>
        <file category="header" name="CMSIS_Driver/Include/Driver_MPC.h"/>
      </files>
    </component>
