saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/ARM.Musca_A1_BSP.2.0.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="PPC" Cversion="1.0.0" condition="Musca CMSIS PPC Device">
      <description>PPC (Preipheral Protection Controller) driver for Musca</description>
      <files>
        <file category="source" name="CMSIS_Driver/Driver_PPC.c"/>
        <file category="header" name="CMSIS_Driver/Include/Driver_PPC.h"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Cversion="1.0.0" condition="Musca CMSIS USART Device">
      <description>USART driver for Musca</description>
      <files>
        <file category="include" name="CMSIS_Driver/Config/"/>
        <file category="source" name="CMSIS_Driver/Driver_USART.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="Flash" Cversion="1.0.0" condition="Musca CMSIS Flash Device">
    <description>Flash driver for Musca</description>
      <files>
        <file category="include" name="CMSIS_Driver/Config/"/>
        <file category="source" name="CMSIS_Driver/Driver_Flash.c"/>
      </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native MPC" Cversion="1.0.0" condition="Musca SoC Device">
      <description>Native MPC driver used by CMSIS Drivers for Musca</description>
      <files>
        <file category="source" name="Native_Driver/mpc_sie200_drv.c"/>
        <file category="header" name="Native_Driver/mpc_sie200_drv.h"/>
      </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native GPIO" Cversion="1.0.0" condition="Musca SCC Driver">
      <description>Native GPIO driver for Musca</description>
      <files>
        <file category="source" name="Native_Driver/gpio_cmsdk_drv.c"/>
        <file category="header" name="Native_Driver/gpio_cmsdk_drv.h"/>
      </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native SCC" Cversion="1.0.0" condition="Musca SoC Device">
      <description>Native SCC driver for Musca</description>
      <files>
        <file category="source" name="Native_Driver/musca_a1_scc_drv.c"/>
        <file category="header" name="Native_Driver/musca_a1_scc_drv.h"/>
      </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native PPC" Cversion="1.0.0" condition="Musca SoC Device">
      <description>Native PPC driver for Musca</description>
      <files>
        <file category="source" name="Native_Driver/ppc_sse200_drv.c"/>
        <file category="header" name="Native_Driver/ppc_sse200_drv.h"/>
      </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native CMSDK Timer" Cversion="1.0.0" condition="Musca SoC Device">
      <description>Native CMSDK Timer driver for Musca</description>
      <files>
        <file category="source" name="Native_Driver/timer_cmsdk_drv.c"/>
        <file category="header" name="Native_Driver/timer_cmsdk_drv.h"/>
      </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native CMSDK DualTimer" Cversion="1.0.0" condition="Musca SoC Device">
      <description>Native CMSDK DualTimer driver for Musca</description>
      <files>
        <file category="source" name="Native_Driver/dualtimer_cmsdk_drv.c"/>
        <file category="header" name="Native_Driver/dualtimer_cmsdk_drv.h"/>
      </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native GP Timer" Cversion="1.0.0" condition="Musca SoC Device">
        <description>Native General-Purpose Timer driver for Musca</description>
        <files>
            <file category="source" name="Native_Driver/timer_gp_drv.c"/>
            <file category="header" name="Native_Driver/timer_gp_drv.h"/>
        </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native MHU" Cversion="1.0.0" condition="Musca SoC Device">
      <description>Native MHU driver for Musca</description>
      <files>
        <file category="source" name="Native_Driver/mhu_sse_200_drv.c"/>
        <file category="header" name="Native_Driver/mhu_sse_200_drv.h"/>
      </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native UART" Cversion="1.0.0" condition="Musca SoC Device">
      <description>Native UART driver for Musca</description>
      <files>
        <file category="source" name="Native_Driver/uart_pl011_drv.c"/>
        <file category="header" name="Native_Driver/uart_pl011_drv.h"/>
      </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native QSPI" Cversion="1.0.0" condition="Musca SoC Device">
        <description>Native QSPI Flash Controller for Musca</description>
        <files>
            <file category="source" name="Native_Driver/qspi_ip6514e_drv.c"/>
            <file category="header" name="Native_Driver/qspi_ip6514e_drv.h"/>
        </files>
    </component>
    <component Cclass="Library" Cgroup="MT25QL QSPI Flash" Cversion="1.0.0" condition="Musca QSPI Device">
        <description>MT25QL Flash Memory Library for Musca Board</description>
        <files>
            <file category="source" name="Libraries/mt25ql_flash_lib.c"/>
            <file category="header" name="Libraries/Include/mt25ql_flash_lib.h"/>
        </files>
    </component>
    <component Cclass="Native Driver" Cgroup="Native SPI" Cversion="1.0.0" condition="Musca SoC Device">
      <description>Native SPI driver for Musca</description>
      <files>
        <file category="source" name="Native_Driver/spi_ip6524_drv.c"/>
        <file category="header" name="Native_Driver/spi_ip6524_drv.h"/>
      </files>
    </component>
  </components>

  <boards>
    <board name="Musca" vendor="ARM" revision="A1" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp">
      <description>ARM Musca A1 SoC IoT Board</description>
      <image small="Documents/V2M-Musca_A_small.jpg"
         large="Documents/V2M-Musca_A_large.jpg"/>
      <mountedDevice    deviceIndex="0" Dvendor="ARM:82" Dname="Musca"/>
      <!-- <compatibleDevice    deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_IOTSS"/> -->
      <feature type="XTAL"      n="50000000"/>
      <feature type="Batt"      n="1"              name="3V battery"/>
      <feature type="Button"    n="2"              name="Push-buttons: Hardware RESET, ON/OFF soft RESET"/>
      <feature type="USB"       n="1"              name="USB 2.0 configuration port"/>
      <feature type="ConnOther" n="1"              name="ARM JTAG 10 Interface"/>

      <debugInterface adapter="JTAG/SW"   connector="10 pin JTAG (0.1 inch connector)"/>
    </board>
  </boards>

 </package>
